jmeter-taurus/run-jmeter.yml
modules:
  jmeter:
    gui: false
    path: ~/.bzt/jmeter-taurus/bin/jmeter
    download-link: https://archive.apache.org/dist/jmeter/binaries/apache-jmeter-{version}.zip
    version: 5.1  # minimal supported version of JMeter is 2.9 (recommended 5.1.1)
    force-ctg: true   # true by default
    detect-plugins: true
    plugins:
      - jpgc-json=2.2
      - jmeter-ftp
      - jpgc-casutg
    properties:
#    my-hostname: www.pre-test.com
      log_level.jmeter: WARN
      log_level.jmeter.threads: DEBUG
#  system-properties:
#    sun.net.http.allowRestrictedHeaders: "true"

execution:
  concurency: 200
  ramp-up: 40s
  steps: 4
  hold-for: 2m30s
  - scenario: simple

scenarios:
  simple:
    script: src/test/java/com/example/scenarios/RandomScenarios.jmx

reporting:
  - module: passfail
    criteria:
      - avg-rt >150ms for 10s, continue as failed
      - fail >50% for 10s, stop as failed